In [1]:
import pandas as pd

In [2]:
df_vent = pd.read_csv("Venta de frutas y veg.csv")
df_vent

    shop_id  item_id   item         item_name  sold  price (Rp)           city
0      1590     3578   Apel       Apel merah   1921       22549     Kab. Bogor
1      1968     4327   Apel  Apel rome beauty  2077       36256   Kota Bandung
2      1911     2153   Apel         Apel fuji  1971       43525    Kota Malang
3      1579     1223   Apel     Apel manalagi  1961       38031  Jakarta Pusat
4      1574     4675   Apel      Apel wanglin  3239       23299     Kab. Bogor
..      ...      ...    ...               ...   ...         ...            ...
95     2876     1467  Timun       Timun lokal  1918       10815   Kota Bandung
96     4787     4070  Timun       Timun lalap  4689       26227    Kota Malang
97     3949     1467  Timun      Timun jepang  3275       11624  Jakarta Pusat
98     1621     4974  Timun        Timun suri   614       18556     Kab. Bogor
99     2736     4267  Timun        Timun mini  3009       24209   Kota Bandung

[100 rows x 7 columns]

In [3]:
type(df_vent)

pandas.core.frame.DataFrame

In [4]:
df_vent.head()

   shop_id  item_id  item         item_name  sold  price (Rp)           city
0     1590     3578  Apel       Apel merah   1921       22549     Kab. Bogor
1     1968     4327  Apel  Apel rome beauty  2077       36256   Kota Bandung
2     1911     2153  Apel         Apel fuji  1971       43525    Kota Malang
3     1579     1223  Apel     Apel manalagi  1961       38031  Jakarta Pusat
4     1574     4675  Apel      Apel wanglin  3239       23299     Kab. Bogor

In [5]:
df_vent.tail()

    shop_id  item_id   item     item_name  sold  price (Rp)           city
95     2876     1467  Timun   Timun lokal  1918       10815   Kota Bandung
96     4787     4070  Timun   Timun lalap  4689       26227    Kota Malang
97     3949     1467  Timun  Timun jepang  3275       11624  Jakarta Pusat
98     1621     4974  Timun    Timun suri   614       18556     Kab. Bogor
99     2736     4267  Timun    Timun mini  3009       24209   Kota Bandung

In [6]:
df_vent.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   shop_id     100 non-null    int64
 1   item_id     100 non-null    int64
 2   item        100 non-null    object
 3   item_name   100 non-null    object
 4   sold        100 non-null    int64
 5   price (Rp)  100 non-null    int64
 6   city        100 non-null    object
dtypes: int64(4), object(3)
memory usage: 5.6+ KB

In [8]:
df_vent["city"].unique()

array(['Kab. Bogor', 'Kota Bandung', 'Kota Malang', 'Jakarta Pusat'],
      dtype=object)

In [9]:
df_vent.nunique()

shop_id        98
item_id        98
item           10
item_name      76
sold          100
price (Rp)    100
city            4
dtype: int64